# Alexine Studios

## Download Dataset

In [ ]:
!mkdir datasets
!wget -qq https://github.com/chiruharshith/Alexine_Studios/blob/main/datasets/five_states.csv -P datasets

In [1]:
# Import pandas and check for the version
import pandas as pd
pd.__version__

'1.2.4'

In [32]:
df = pd.read_csv("datasets/five_states.csv")
df

,State Name,Capital,Area,Population,Largest City
0,Karnataka,Bangalore,"1,91,791 sq. km","6,11,30,704",Bengaluru
1,Tamil Nadu,Chennai,"1,30,058 sq. km","7,21,38,958",Tamil
2,Telangana,Hyderabad,"112,077 Sq. Kms",350.04 Lakhs,Hyderabad
3,Maharashtra,Mumbai,"3,07,713 sq. km","11,23,72,972",Mumbai
4,Kerala,Thiruvananthapuram,"38,863 sq. km","3,33,87,677",Malappuram

In [7]:
# Display only Capitals and States columns from the dataframe
df[['Capital ','State Name ']]

             Capital   State Name
0           Bangalore    Karnataka
1             Chennai   Tamil Nadu
2           Hyderabad   Telangana
3             Mumbai   Maharashtra
4  Thiruvananthapuram       Kerala

In [33]:
def removeAlpha(X):
    return ''.join(filter(str.isdigit, X))

df.Population = df.Population.apply(removeAlpha)
df['Area '] = df['Area '].apply(removeAlpha)
df

   State Name             Capital    Area  Population Largest City
0    Karnataka           Bangalore  191791   61130704     Bengaluru
1   Tamil Nadu             Chennai  130058   72138958         Tamil
2   Telangana            Hyderabad  112077      35004     Hyderabad
3  Maharashtra             Mumbai   307713  112372972       Mumbai
4       Kerala  Thiruvananthapuram   38863   33387677    Malappuram

### e) Change the count of visitors to 5500 for the row with the index value "44,212" in the dataframe

In [34]:
list(df['Area '])

['191791', '130058', '112077', '307713', '38863']

In [35]:
df.at[4,'Area '] = 10000
df

   State Name             Capital    Area  Population Largest City
0    Karnataka           Bangalore  191791   61130704     Bengaluru
1   Tamil Nadu             Chennai  130058   72138958         Tamil
2   Telangana            Hyderabad  112077      35004     Hyderabad
3  Maharashtra             Mumbai   307713  112372972       Mumbai
4       Kerala  Thiruvananthapuram   10000   33387677    Malappuram

In [40]:
df = df.set_index('State Name ')

In [50]:
df['Largest City ']['Kerala']

'Malappuram'